app/views/collections/show.html.erb


<% if @collection.flashcards.length > 0 %>
---
SELECT "flashcards".* FROM "flashcards" INNER JOIN "card_collections" ON "flashcards"."id" = "card_collections"."flashcard_id" WHERE "card_collections"."collection_id" = ?  [["collection_id", 9]]


          <% @collection.flashcards.each do |flash|%>
---
SELECT "flashcards".* FROM "flashcards"

        <%= f.label  :name  %>
        <%= f.collection_select(:flashcard_ids, Flashcard.all, :id, :question, {prompt: true}, {multiple: true}) %>
---
SELECT "flashcards".* FROM "flashcards"