app/views/flashcards/show.html.erb


<%= link_to '<button type="button">Delete Flashcard</button>'.html_safe, @flashcard.destroy %>
---
DELETE FROM "flashcards" WHERE "flashcards"."id" = ?  [["id", 1]]