app/views/users/show.html.erb

       <ul>
       <% if @user.collections.length > 0 %>
       <p>Your Collections: </p>
       <% @user.collections.each do |collection| %>
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = ?  [["user_id", 38]]