app/controllers/collections_controller.rb

    def show
        @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        @collection = Collection.new(collection_params)
        @collection.user = current_user
        @collection.save
---
INSERT INTO "card_collections" ("collection_id", "flashcard_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["collection_id", 12], ["flashcard_id", 43], ["created_at", "2020-04-17 18:02:32.853973"], ["updated_at", "2020-04-17 18:02:32.853973"]]
INSERT INTO "collections" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 35], ["name", "Maths"], ["created_at", "2020-04-17 03:32:14.565483"], ["updated_at", "2020-04-17 03:32:14.565483"]]

    def update
        @collection = Collection.find(collection_params[:collection_id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]