app/controllers/flashcards_controller.rb

SELECT "flashcards".* FROM "flashcards"
---
    def index
        @flashcards = Flashcard.all

SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @flashcard = Flashcard.find(params[:id])

INSERT INTO "flashcards" ("question", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question", "8 - 1"], ["answer", "4"], ["created_at", "2020-04-17 03:33:04.811366"], ["updated_at", "2020-04-17 03:33:04.811366"]]
---
    def create
        @flashcard = Flashcard.new(flashcard_params)
        @flashcard.save

SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
---
    def edit
        @flashcard = Flashcard.find(params[:id])

SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
UPDATE "flashcards" SET "question" = ?, "answer" = ?, "updated_at" = ? WHERE "flashcards"."id" = ?  [["question", nil], ["answer", nil], ["updated_at", "2020-04-17 05:24:54.158078"], ["id", 40]]
---
    def update
        @flashcard = Flashcard.find(params[:id])
        @flashcard.update(question: params[:flashcard][:question], answer: params[:flashcard][:answer])

SELECT "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
DELETE FROM "flashcards" WHERE "flashcards"."id" = ?  [["id", 47]]
---
    def destroy
        @flashcard = Flashcard.find(params[:id])
        @flashcard.destroy